
// 什么是表达式？
// eg： 5, a, m + 3, sum = a + b, n = x * y + (x % 2) - (x / y)

// 运算符：
// 算术运算符： +, -, *, /, %, ++, --
// 赋值运算符： =, +=, -=, *=, /=, %=
// 关系运算符： ==, !=, <, <=, >, >=
// 逻辑运算符： !, &, &&, |, ||
// 条件运算符： ?:

// 参考资料： https://www.jianshu.com/p/9d2204712097
// & : 两个操作数都是true，结果才是true；左边取值无论真假，右边都会运算
// | : 两个操作数一个是true，结果就是true；左边取值无论真假，右边都会运算
// ^ : 两个操作相同，结果是false；两个操作不相同，结果是true
// ! : 操作数是true，结果是false；操作数是false，结果是true
// && : 两个操作数都是true，结果才是true；左边取值是false，右边不会运算
// || : 两个操作数一个是true，结果就是true；左边取值是true，右边不会运算

// 条件运算符， eg：
// 如果 a 等于 1 成立，则设置 b 为 20，否则为 30
// b = (a == 1) ? 20 : 30;


// 运算符的优先级：
// 参考资料： https://www.jianshu.com/p/9d2204712097